package com.imtiaz_acedamy.july2024app.Fragment;

import android.content.Context;
import android.os.Bundle;

import androidx.annotation.NonNull;
import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.text.Editable;
import android.text.TextWatcher;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.imtiaz_acedamy.july2024app.Adapter.NewsAdapter;
import com.imtiaz_acedamy.july2024app.Adapter.NewsAdapter2;
import com.imtiaz_acedamy.july2024app.Domain.NewsItems;
import com.imtiaz_acedamy.july2024app.R;
import com.imtiaz_acedamy.july2024app.databinding.FragmentNewsListBinding;

import java.util.ArrayList;

public class NewsListFragment extends Fragment {

    FragmentNewsListBinding binding;
    Context context;
    ArrayList<NewsItems> list;
    ArrayList<NewsItems> filteredList;
    NewsAdapter2 adapter;


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        binding = FragmentNewsListBinding.inflate(inflater, container, false);
        context = getContext();

        initNewsInit();
        scrollAnimation();
        LetestNewsInit();

        return binding.getRoot();
    }

    private void LetestNewsInit(){
        ArrayList<NewsItems> list = new ArrayList<>();

        list.add(new NewsItems("বৈষম্যবিরোধী ছাত্র আন্দোলনের তিন দাবি","২ ঘন্টা আগে", "সোমবার বিকালে ঢাকা বিশ্ববিদ্যালয়ের সন্ত্রাসবিরোধী রাজু ভাস্কর্যের পাদদেশে বৈষম্যবিরোধী ছাত্র আন্দোলনের উদ্যোগে " +
                "‘খুনি শেখ হাসিনার বিচার দাবি ও ক্যাম্পাসে দখলদারিত্বের রাজনীতি বন্ধের’ দাবিতে সমাবেশ হয়। এ সময় খুনিদের পুনর্বাসন করার ষড়যন্ত্র হচ্ছে জানিয়ে সমন্বয়ক হাসনাত" +
                " আব্দুল্লাহ উপদেষ্টাদের বক্তব্যের সমালোচনা করেন এবং তিন দফা দাবি তুলে ধরেন। কোটা সংস্কার আন্দোলনকারীদের প্লাটফর্ম বৈষম্যবিরোধী ছাত্র আন্দোলনের কমিটি ৬৫ সদস্য থেকে বাড়িয়ে ১৫৮ সদস্য করা হয়েছে।\n" +
                "\n" +
                "শনিবার বৈষম্যবিরোধী ছাত্র আন্দোলনের প্যাডে এক বিজ্ঞপ্তিতে এ ঘোষণা দেন আন্দোলনের অন্যতম সমন্বয়ক রিফাত রশিদ।\n" +
                "\n" +
                "বিজ্ঞপ্তিতে বলা হয়, “বৈষম্যবিরোধী ছাত্র আন্দোলনে নির্মমভাবে চালানো গণহত্যার বিচার, গণহত্যায় দায়ীদের পদত্যাগ এবং গ্রেপ্তারদের মুক্তির দাবিতে সারা দেশে আন্দোলনরত শিক্ষার্থী প্রতিনিধিদের নিয়ে ১৫৮ সদস্য বিশিষ্ট সমন্বয়ক টিম গঠন করা হল।”\n" +
                "\n" +
                "আন্দোলনের সুবিধার্থে সামনের দিনে দেশের বিভিন্ন প্রতিষ্ঠানের সমন্বয়কদের নিয়ে সমন্বয়ক টিম বর্ধিত করা হবে বলেও বিজ্ঞপ্তিতে জানানো হয়।\n" +
                "\n" +
                "বর্ধিত কমিটিতে সমন্বয়ক হিসেবে ৪৯ জন এবং সহ-সমন্বয়ক হিসেবে ১০৯ জন শিক্ষার্থীকে রাখা হয়েছে।\n" +
                "\n" +
                "চাকরিতে কোটা বাতিল করে ২০১৮ সালে জারি করা পরিপত্রটি হাই কোর্ট বাতিল করার প্রতিক্রিয়ায় আন্দোলনে নামে শিক্ষার্থীরা। কোটা আন্দোলনের কর্মসূচি বাস্তবায়নে গত ৮ জুলাই ৬৫ সদস্য বিশিষ্ট সমন্বয়ক টিম গঠন করে বৈষম্যবিরোধী ছাত্র আন্দোলন।\n" +
                "\n" +
                "ওই কমিটিতে সমন্বয়ক হিসেবে ২৩ জন এবং ৪২ জনকে সহ-সমন্বয়ক হিসেবে রাখা হয়েছিল। এবার কমিটি বর্ধিত করে এখন ১৫৮ সদস্যের করা হল।", R.drawable.news_img_1, "জামাল খান, চট্টগ্রাম"));
        list.add(new NewsItems("আজ যে কর্মসূচি পালন করবে বৈষম্যবিরোধী ছাত্র আন্দোলন","৪ ঘন্টা আগে", "শেখ হাসিনার বিচারসহ চার দফা দাবিতে সপ্তাহব্যাপী কর্মসূচির ডাক দিয়েছে বৈষম্যবিরোধী ছাত্র আন্দোলন। ‘রেজিস্টান্স উইক’-এর অংশ হিসেবে আজ বুধবার (১৪ আগস্ট) বিকেল সাড়ে ৪টায় শাহবাগে অবস্থান কর্মসূচি এবং শহীদদের স্মরণে শাহবাগ থেকে রাফা প্লাজা অভিমুখে পদযাত্রা, মোমবাতি প্রজ্জ্বলন ও প্রার্থনা কর্মসূচির আয়োজন করা হয়েছে।\n" +
                "\n" +
                "বৈষম্যবিরোধী ছাত্র আন্দোলনের সমন্বয়ক হাসনাত আব্দুল্লাহ নিজের ফেসবুক লাইভে বলেন, শিক্ষার্থী মুগ্ধ-ফাইয়াজসহ যেসব সহযোদ্ধারা রাজপথে রক্ত ঝড়িয়ে নিজের জীবন দিয়ে শহীদ হয়েছেন, তাদের স্মরণে আজ বিকেল সাড়ে ৪টায় জমায়েত হওয়ার আহ্বান জানানো হচ্ছে শিক্ষার্থীদের।\n" +
                "\n" +
                "তিনি আরও বলেন, সেখান থেকে মিছিল শুরু হবে। মিছিল প্রদক্ষিণ করে ধানমন্ডি ৩২-এর রাফা প্লাজা ভবনের সামনে গিয়ে মুগ্ধ-ফাইয়াজসহ অন্যান্য শহীদকে স্মরণ করা হবে। সেখানে আমরা মোমবাতি প্রজ্বলন করব এবং ধর্মীয় বিধান অনুযায়ী প্রার্থনা করব।\n" +
                "\n" +
                "সমন্বয়ক হাসনাত আব্দুল্লাহ বলেন, ধানমন্ডির ওই এলাকার স্কুল-কলেজের সকল শিক্ষার্থী রাফা প্লাজা অভিমুখে যাত্রা করবেন এবং তাদের এই কর্মসূচিতে অংশগ্রহণ করার আহ্বান জানানো হচ্ছে।\n" +
                "\n" +
                "বৈষম্যবিরোধী ছাত্র আন্দোলনের চার দফা দাবিগুলো হলো–\n" +
                "\n" +
                "১ ) ফ্যাসিবাদী কাঠামোকে ব্যবহার করে ফ্যাসিস্ট হাসিনা এবং তার দল ও সরকার যে হত্যাযজ্ঞ চালিয়েছে, সেগুলোর দ্রুত বিচার নিশ্চিত করতে বিশেষ ট্রাইব্যুনাল গঠন করতে হবে।\n" +
                "\n" +
                "২ ) সংখ্যালঘুদের ওপর আওয়ামী লীগ ও এর সহযোগী মহাজোটের শরিক দলগুলোর পরিকল্পিত হত্যা, ডাকাতি ও লুণ্ঠনের মাধ্যমে গণ-অভ্যুত্থানকে বিতর্কিত করার প্রচেষ্টায় অংশগ্রহণকারীদের দ্রুত বিচারের আওতায় আনতে হবে এবং সংখ্যালঘুদের ন্যায্য দাবি মেনে নিতে হবে।\n" +
                "\n" +
                "৩ ) প্রশাসন ও বিচার বিভাগে যারা ছাত্র-জনতার অভ্যুত্থানে হামলা, মামলা এবং হত্যাযজ্ঞকে বৈধতা দিয়েছে এবং ফ্যাসিবাদী ব্যবস্থা বারবার কায়েমের চেষ্টা করছে, তাদের দ্রুততম সময়ে অপসারণ ও নতুন সরকারে তাদের নিয়োগ বাতিল করে বিচারের আওতায় আনতে হবে।\n" +
                "\n" +
                "৪ ) প্রশাসন ও বিচার বিভাগে যারা এতদিন বৈষম্যের শিকার হয়েছে, তাদের জন্য দ্রুততম সময়ে সুযোগের সমতা নিশ্চিত করতে হবে।", R.drawable.news_img_2, "তিতুমির হল,রাজশাহী"));

        list.add(new NewsItems("এবার ‘কমপ্লিট শাটডাউন’ ঘোষণা বৈষম্যবিরোধী ছাত্র আন্দোলনের","১ ঘন্টা আগে", "সারা দেশে বৃহস্পতিবার থেকে 'কমপ্লিট শাটডাউন' কর্মসূচি ঘোষণা করেছে বৈষম্যবিরোধী ছাত্র আন্দোলন।\n" +
                "\n" +
                "বুধবার সন্ধ্যায় এ ঘোষণা দেন বৈষম্যবিরোধী ছাত্র আন্দোলনের অন্যতম সমন্বয়ক আসিফ মাহমুদ।\n" +
                "\n" +
                "কর্মসূচির বিস্তারিত জানিয়ে রাত পৌনে ৮টায় ফেসবুকে একটি পোস্ট দিয়েছেন আসিফ মাহমুদ।\n" +
                "\n" +
                "‘যা বাবা, ভালো থাকিস চিন্তা করিস না’, সাঈদকে চিরবিদায় কালে মা\n" +
                "\n" +
                "তিনি লেখেন, 'শিক্ষার্থীদের শান্তিপূর্ণ আন্দোলনে ওপর পুলিশ, বিজিবি, র\u200D্যাব, সোয়াটের ন্যাক্কারজনক হামলা, খুনের প্রতিবাদ, খুনিদের বিচার, সন্ত্রাসমুক্ত ক্যাম্পাস নিশ্চিত ও এক দফা দাবিতে আগামীকাল ১৮ই জুলাই সারা দেশে ‘কমপ্লিট শাটডাউন’ ঘোষণা করছি।'\n" +
                "\n" +
                "'শুধুমাত্র হাসপাতাল ও জরুরি সেবা ব্যতীত কোনো প্রতিষ্ঠানের দরজা খুলবে না, অ্যাম্বুলেন্স ব্যতীত সড়কে কোনো গাড়ি চলবে না। সারা দেশের প্রতিটি স্কুল, কলেজ, বিশ্ববিদ্যালয়, প্রাইভেট বিশ্ববিদ্যালয়, মাদরাসা শিক্ষার্থীদের আহ্বান জানাচ্ছি আগামীকালকের কর্মসূচি সফল করুন।\n" +
                "\n" +
                "তিনি আরও লেখেন, 'আমাদের অভিভাবকদের বলছি, আমরা আপনাদেরই সন্তান। আমাদের পাশে দাঁড়ান, রক্ষা করুন। এই লড়াইটা শুধু ছাত্রদের না, দলমত নির্বিশেষে এদেশের আপামর জনসাধারণের'।", R.drawable.news_img_3, "২ নং গেইট, চট্টগ্রাম"));


        binding.view5.setLayoutManager(new LinearLayoutManager(context, LinearLayoutManager.HORIZONTAL, false));
        binding.view5.setAdapter(new NewsAdapter(list));


    }

    private void scrollAnimation() {
        binding.view4.addOnScrollListener(new RecyclerView.OnScrollListener() {

            @Override
            public void onScrolled(@NonNull RecyclerView recyclerView, int dx, int dy) {
                super.onScrolled(recyclerView, dx, dy);

                if (recyclerView.canScrollVertically(-1)) {
                    if (dy > 0 && binding.helloTv.getVisibility() == View.VISIBLE) {
                        binding.helloTv.animate().translationY(-binding.helloTv.getHeight()).setDuration(10).start();
                        binding.view5.animate().translationY(-binding.helloTv.getHeight()).setDuration(10).start();
                        binding.helloTv.setVisibility(View.GONE);
                        binding.view5.setVisibility(View.GONE);
                    }
                }
            }

            @Override
            public void onScrollStateChanged(@NonNull RecyclerView recyclerView, int newState) {
                super.onScrollStateChanged(recyclerView, newState);

                if (!recyclerView.canScrollVertically(-1)) {
                    if (binding.helloTv.getVisibility() == View.GONE) {
                        binding.helloTv.animate().translationY(0).setDuration(100).start();
                        binding.view5.animate().translationY(0).setDuration(100).start();
                        binding.helloTv.setVisibility(View.VISIBLE);
                        binding.view5.setVisibility(View.VISIBLE);
                    }
                }
            }
        });
    }


    private void initNewsInit(){

        list = new ArrayList<>();
        filteredList = new ArrayList<>();

        populateList();

        binding.view4.setLayoutManager(new LinearLayoutManager(context, LinearLayoutManager.VERTICAL, false));

        adapter = new NewsAdapter2(filteredList);
        binding.view4.setAdapter(adapter);

        binding.searchBar.addTextChangedListener(new TextWatcher() {
            @Override
            public void beforeTextChanged(CharSequence s, int start, int count, int after) {
            }

            @Override
            public void onTextChanged(CharSequence s, int start, int before, int count) {
                filter(s.toString());
            }

            @Override
            public void afterTextChanged(Editable s) {
            }
        });

        // Initially display the full list
        filter("");


    }

    private void populateList() {
        list.add(new NewsItems("বৈষম্যবিরোধী ছাত্র আন্দোলনের তিন দাবি","২ ঘন্টা আগে", "সোমবার বিকালে ঢাকা বিশ্ববিদ্যালয়ের সন্ত্রাসবিরোধী রাজু ভাস্কর্যের পাদদেশে বৈষম্যবিরোধী ছাত্র আন্দোলনের উদ্যোগে " +
                "‘খুনি শেখ হাসিনার বিচার দাবি ও ক্যাম্পাসে দখলদারিত্বের রাজনীতি বন্ধের’ দাবিতে সমাবেশ হয়। এ সময় খুনিদের পুনর্বাসন করার ষড়যন্ত্র হচ্ছে জানিয়ে সমন্বয়ক হাসনাত" +
                " আব্দুল্লাহ উপদেষ্টাদের বক্তব্যের সমালোচনা করেন এবং তিন দফা দাবি তুলে ধরেন। কোটা সংস্কার আন্দোলনকারীদের প্লাটফর্ম বৈষম্যবিরোধী ছাত্র আন্দোলনের কমিটি ৬৫ সদস্য থেকে বাড়িয়ে ১৫৮ সদস্য করা হয়েছে।\n" +
                "\n" +
                "শনিবার বৈষম্যবিরোধী ছাত্র আন্দোলনের প্যাডে এক বিজ্ঞপ্তিতে এ ঘোষণা দেন আন্দোলনের অন্যতম সমন্বয়ক রিফাত রশিদ।\n" +
                "\n" +
                "বিজ্ঞপ্তিতে বলা হয়, “বৈষম্যবিরোধী ছাত্র আন্দোলনে নির্মমভাবে চালানো গণহত্যার বিচার, গণহত্যায় দায়ীদের পদত্যাগ এবং গ্রেপ্তারদের মুক্তির দাবিতে সারা দেশে আন্দোলনরত শিক্ষার্থী প্রতিনিধিদের নিয়ে ১৫৮ সদস্য বিশিষ্ট সমন্বয়ক টিম গঠন করা হল।”\n" +
                "\n" +
                "আন্দোলনের সুবিধার্থে সামনের দিনে দেশের বিভিন্ন প্রতিষ্ঠানের সমন্বয়কদের নিয়ে সমন্বয়ক টিম বর্ধিত করা হবে বলেও বিজ্ঞপ্তিতে জানানো হয়।\n" +
                "\n" +
                "বর্ধিত কমিটিতে সমন্বয়ক হিসেবে ৪৯ জন এবং সহ-সমন্বয়ক হিসেবে ১০৯ জন শিক্ষার্থীকে রাখা হয়েছে।\n" +
                "\n" +
                "চাকরিতে কোটা বাতিল করে ২০১৮ সালে জারি করা পরিপত্রটি হাই কোর্ট বাতিল করার প্রতিক্রিয়ায় আন্দোলনে নামে শিক্ষার্থীরা। কোটা আন্দোলনের কর্মসূচি বাস্তবায়নে গত ৮ জুলাই ৬৫ সদস্য বিশিষ্ট সমন্বয়ক টিম গঠন করে বৈষম্যবিরোধী ছাত্র আন্দোলন।\n" +
                "\n" +
                "ওই কমিটিতে সমন্বয়ক হিসেবে ২৩ জন এবং ৪২ জনকে সহ-সমন্বয়ক হিসেবে রাখা হয়েছিল। এবার কমিটি বর্ধিত করে এখন ১৫৮ সদস্যের করা হল।", R.drawable.news_img_1, "জামাল খান, চট্টগ্রাম"));
        list.add(new NewsItems("আজ যে কর্মসূচি পালন করবে বৈষম্যবিরোধী ছাত্র আন্দোলন","৪ ঘন্টা আগে", "শেখ হাসিনার বিচারসহ চার দফা দাবিতে সপ্তাহব্যাপী কর্মসূচির ডাক দিয়েছে বৈষম্যবিরোধী ছাত্র আন্দোলন। ‘রেজিস্টান্স উইক’-এর অংশ হিসেবে আজ বুধবার (১৪ আগস্ট) বিকেল সাড়ে ৪টায় শাহবাগে অবস্থান কর্মসূচি এবং শহীদদের স্মরণে শাহবাগ থেকে রাফা প্লাজা অভিমুখে পদযাত্রা, মোমবাতি প্রজ্জ্বলন ও প্রার্থনা কর্মসূচির আয়োজন করা হয়েছে।\n" +
                "\n" +
                "বৈষম্যবিরোধী ছাত্র আন্দোলনের সমন্বয়ক হাসনাত আব্দুল্লাহ নিজের ফেসবুক লাইভে বলেন, শিক্ষার্থী মুগ্ধ-ফাইয়াজসহ যেসব সহযোদ্ধারা রাজপথে রক্ত ঝড়িয়ে নিজের জীবন দিয়ে শহীদ হয়েছেন, তাদের স্মরণে আজ বিকেল সাড়ে ৪টায় জমায়েত হওয়ার আহ্বান জানানো হচ্ছে শিক্ষার্থীদের।\n" +
                "\n" +
                "তিনি আরও বলেন, সেখান থেকে মিছিল শুরু হবে। মিছিল প্রদক্ষিণ করে ধানমন্ডি ৩২-এর রাফা প্লাজা ভবনের সামনে গিয়ে মুগ্ধ-ফাইয়াজসহ অন্যান্য শহীদকে স্মরণ করা হবে। সেখানে আমরা মোমবাতি প্রজ্বলন করব এবং ধর্মীয় বিধান অনুযায়ী প্রার্থনা করব।\n" +
                "\n" +
                "সমন্বয়ক হাসনাত আব্দুল্লাহ বলেন, ধানমন্ডির ওই এলাকার স্কুল-কলেজের সকল শিক্ষার্থী রাফা প্লাজা অভিমুখে যাত্রা করবেন এবং তাদের এই কর্মসূচিতে অংশগ্রহণ করার আহ্বান জানানো হচ্ছে।\n" +
                "\n" +
                "বৈষম্যবিরোধী ছাত্র আন্দোলনের চার দফা দাবিগুলো হলো–\n" +
                "\n" +
                "১ ) ফ্যাসিবাদী কাঠামোকে ব্যবহার করে ফ্যাসিস্ট হাসিনা এবং তার দল ও সরকার যে হত্যাযজ্ঞ চালিয়েছে, সেগুলোর দ্রুত বিচার নিশ্চিত করতে বিশেষ ট্রাইব্যুনাল গঠন করতে হবে।\n" +
                "\n" +
                "২ ) সংখ্যালঘুদের ওপর আওয়ামী লীগ ও এর সহযোগী মহাজোটের শরিক দলগুলোর পরিকল্পিত হত্যা, ডাকাতি ও লুণ্ঠনের মাধ্যমে গণ-অভ্যুত্থানকে বিতর্কিত করার প্রচেষ্টায় অংশগ্রহণকারীদের দ্রুত বিচারের আওতায় আনতে হবে এবং সংখ্যালঘুদের ন্যায্য দাবি মেনে নিতে হবে।\n" +
                "\n" +
                "৩ ) প্রশাসন ও বিচার বিভাগে যারা ছাত্র-জনতার অভ্যুত্থানে হামলা, মামলা এবং হত্যাযজ্ঞকে বৈধতা দিয়েছে এবং ফ্যাসিবাদী ব্যবস্থা বারবার কায়েমের চেষ্টা করছে, তাদের দ্রুততম সময়ে অপসারণ ও নতুন সরকারে তাদের নিয়োগ বাতিল করে বিচারের আওতায় আনতে হবে।\n" +
                "\n" +
                "৪ ) প্রশাসন ও বিচার বিভাগে যারা এতদিন বৈষম্যের শিকার হয়েছে, তাদের জন্য দ্রুততম সময়ে সুযোগের সমতা নিশ্চিত করতে হবে।", R.drawable.news_img_2, "তিতুমির হল,রাজশাহী"));
        list.add(new NewsItems("এবার ‘কমপ্লিট শাটডাউন’ ঘোষণা বৈষম্যবিরোধী ছাত্র আন্দোলনের","১ ঘন্টা আগে", "সারা দেশে বৃহস্পতিবার থেকে 'কমপ্লিট শাটডাউন' কর্মসূচি ঘোষণা করেছে বৈষম্যবিরোধী ছাত্র আন্দোলন।\n" +
                "\n" +
                "বুধবার সন্ধ্যায় এ ঘোষণা দেন বৈষম্যবিরোধী ছাত্র আন্দোলনের অন্যতম সমন্বয়ক আসিফ মাহমুদ।\n" +
                "\n" +
                "কর্মসূচির বিস্তারিত জানিয়ে রাত পৌনে ৮টায় ফেসবুকে একটি পোস্ট দিয়েছেন আসিফ মাহমুদ।\n" +
                "\n" +
                "‘যা বাবা, ভালো থাকিস চিন্তা করিস না’, সাঈদকে চিরবিদায় কালে মা\n" +
                "\n" +
                "তিনি লেখেন, 'শিক্ষার্থীদের শান্তিপূর্ণ আন্দোলনে ওপর পুলিশ, বিজিবি, র\u200D্যাব, সোয়াটের ন্যাক্কারজনক হামলা, খুনের প্রতিবাদ, খুনিদের বিচার, সন্ত্রাসমুক্ত ক্যাম্পাস নিশ্চিত ও এক দফা দাবিতে আগামীকাল ১৮ই জুলাই সারা দেশে ‘কমপ্লিট শাটডাউন’ ঘোষণা করছি।'\n" +
                "\n" +
                "'শুধুমাত্র হাসপাতাল ও জরুরি সেবা ব্যতীত কোনো প্রতিষ্ঠানের দরজা খুলবে না, অ্যাম্বুলেন্স ব্যতীত সড়কে কোনো গাড়ি চলবে না। সারা দেশের প্রতিটি স্কুল, কলেজ, বিশ্ববিদ্যালয়, প্রাইভেট বিশ্ববিদ্যালয়, মাদরাসা শিক্ষার্থীদের আহ্বান জানাচ্ছি আগামীকালকের কর্মসূচি সফল করুন।\n" +
                "\n" +
                "তিনি আরও লেখেন, 'আমাদের অভিভাবকদের বলছি, আমরা আপনাদেরই সন্তান। আমাদের পাশে দাঁড়ান, রক্ষা করুন। এই লড়াইটা শুধু ছাত্রদের না, দলমত নির্বিশেষে এদেশের আপামর জনসাধারণের'।", R.drawable.news_img_3, "২ নং গেইট, চট্টগ্রাম"));

        list.add(new NewsItems("বৈষম্যবিরোধী ছাত্র আন্দোলনের নতুন কর্মসূচি ঘোষণা","৬ ঘন্টা আগে", "নতুন কর্মসূচি ঘোষণা করেছে কোটা সংস্কার আন্দোলনের প্ল্যাটফর্ম বৈষম্যবিরোধী ছাত্র আন্দোলন। ঘোষিত কর্মসূচি অনুযায়ী শুক্রবার (২ আগস্ট) সারাদেশের মসজিদে মসজিদে জুমার নামাজের পরে দোয়া-কবর জিয়ারত, মন্দির, গির্জাসহ সব প্রার্থনালয়ে প্রার্থনা এবং জুমার নামাজের শেষে ছাত্র-জনতার গণমিছিলের ঘোষণা দেওয়া হয়েছে।\n\n" +
                "বৃহস্পতিবার (১ জুলাই) বিকেল ৫টা ৪০ মিনিটে বৈষম্যবিরোধী ছাত্র আন্দোলন পরিচালিত “কোটা পুনর্বহাল চলবে না” টেলিগ্রাম গ্রুপে অন্যতম সমন্বয়ক আব্দুল কাদের এই ঘোষণা দেন। \n" +
                "\n" +
                "বিবৃতিতে, শ্রমিক, পেশাজীবী, সংস্কৃতিকর্মী, গণমাধ্যমকর্মী, মানবাধিকারকর্মী, বুদ্ধিজীবী, আলেম-ওলামাসহ বাংলাদেশের সব স্তরের নাগরিকদের আগামীকালের ‘প্রার্থনা ও ছাত্র জনতার গণমিছিল’ কর্মসূচিকে স্বতঃস্ফূর্তভাবে সফল করার আহ্বান জানানো হয়।\n \n " +
                "শিক্ষকদের ওপর হামলার নিন্দা জানিয়ে বলা হয়, আজ ছাত্রসমাজ ঘরে শান্তিতে ঘুমাতে পারছে না। প্রতিমুহূর্তে কাটাতে হচ্ছে গ্রেপ্তার ও গুম হওয়ার আতঙ্কে। শহীদ ও গুম হয়ে যাওয়া মানুষের স্বজনের আহাজারিতে ভারী হয়ে উঠছে বাংলার আকাশ বাতাস। এছাড়াও আগামীর বাংলাদেশ গড়ার কারিগর জাতির শ্রেষ্ঠ সন্তান বিশ্ববিদ্যালয়ের সম্মানিত শিক্ষকমন্ডলীর ওপর ক্যাম্পাসের ভেতরে হামলা করেছে পুলিশ। ঢাকা বিশ্ববিদ্যালয়ের লোকপ্রশাসন বিভাগের শ্রদ্ধেয় শিক্ষিকা শেহরীন আমিন মোনামী ও নুসরাত জাহান চৌধুরীর গায়েও হাত তুলেছে পুলিশের কিছু কর্মকর্তা। এই ঘৃণ্য হামলার আমরা তীব্র নিন্দা ও প্রতিবাদ জানাচ্ছি।\n" +
                "\n" +
                "শিক্ষার্থী ও সাধারণ মানুষের ওপর অমানবিক নির্যাতনের কথা উল্লেখ করে বলা হয়, বরিশাল বিশ্ববিদ্যালয়ের ৬ জন সমন্বয়কসহ অসংখ্য ছাত্র-জনতাকে গতকাল গ্রেপ্তার করা হয়েছে। আজ কেন্দ্রীয় ৬ সমন্বয়ককে ডিবি কার্যালয় থেকে ছেড়ে দিলেও এখনো ডাকসুর সাবেক সমাজ সেবা সম্পাদক আক্তার হোসেন, সমন্বয়ক আরিফ সোহেলসহ অসংখ্য ছাত্র জনতাকে কারাগার ও রিমান্ডে নির্যাতন করছে। জুলুম নির্যাতনে নিষ্পেষিত ছাত্র জনতা মুক্তির প্রহর গুনছে। অসংখ্য ছাত্র জনতা হাসপাতালের বেডে কাতরাচ্ছে চিরতরে পঙ্গু হয়ে যাওয়ার শঙ্কা নিয়ে। অনেক ছাত্র ও সাধারণ মানুষ চোখ, কান, হাত, পা কিংবা শরীরের অন্য কোনো অঙ্গ হারিয়ে চিরতরে পঙ্গু হয়ে গেছে।\n" +
                "\n" +
                "এই আন্দোলন কোনো ব্যক্তিগত স্বার্থে নয় উল্লেখ করে বলা হয়, আমাদের আন্দোলন আপনার ও আপনার সন্তানের মুক্তির জন্য। কী অপরাধ ছিল আমাদের? সাংবিধানিক অধিকার চাওয়াটা কি আমাদের অপরাধ? কী অপরাধে শত শত ভাইদের হত্যা করা হলো? আমরা এর জবাব জানি না। কিন্তু এর জবাব ও বিচার না নিয়ে আমরা আমাদের আন্দোলনকে থামাবো না। জাতির এই দুর্দিনে আন্দোলনে অংশ নেওয়ার অপরাধে শহীদ, আহত, পঙ্গু ও গ্রেপ্তার হওয়া সবার স্মরণে আগামীকাল দেশব্যাপী ‘প্রার্থনা-কবর জিয়ারত ও ছাত্র জনতার গণমিছিল’ কর্মসূচি ঘোষণা করছি।", R.drawable.news_img_4,"সদর ঘাট, ফেনী"));
        list.add(new NewsItems("বৈষম্যবিরোধী ছাত্র আন্দোলন শিক্ষার্থীদের ৮ বার্তা দিয়েছে","১১ ঘন্টা আগে", "কোটা সংস্কার আন্দোলনকারীদের প্ল্যাটফর্ম বৈষম্যবিরোধী ছাত্র আন্দোলন – হতাহতদের তালিকা তৈরি, হত্যা ও হামলায় জড়িতদের চিহ্নিত করা, বিশ্ববিদ্যালয় ও হল খুলে দেওয়ার চাপ তৈরি করাসহ আটটি বার্তা দিয়েছে। আন্দোলনকারী শিক্ষার্থীদের উদ্দেশে এসব বার্তা দেন তারা।\n" +
                "\n" +
                "বৃহস্পতিবার (২৫ জুলাই) দুপুরে এসব বার্তাসংবলিত একটি বিবৃতি সামাজিক যোগাযোগমাধ্যম ফেসবুকে পোস্ট করেছেন বৈষম্যবিরোধী ছাত্র আন্দোলনের সমন্বয়ক আসিফ মাহমুদ, আবু বাকের মজুমদার ও রিফাত রশীদ। ‘বর্তমান পরিস্থিতিতে বৈষম্যবিরোধী ছাত্র আন্দোলনের অন্যতম সমন্বয়ক মো. নাহিদ ইসলামের বক্তব্য’ শিরোনামে বিবৃতিটি পোস্ট করা হয়।\n" +
                "\n" +
                "বিবৃতিতে দেওয়া বার্তাগুলো হলো- রংপুরের আবু সাঈদসহ নিহতদের স্মরণ করুন; তাঁদের কবর জিয়ারত করুন; পরিবারের প্রতি সমবেদনা জানান; হাসপাতালে থাকা আহতদের যথাসম্ভব সহযোগিতার চেষ্টা করুন; সক্ষমতা থাকলে নিহতদের পরিবারের কাছে লাশ হস্তান্তর করতে সহায়তা করুন; মর্যাদার সঙ্গে দাফন ও জানাজায় অংশ নিন; হতাহতদের তালিকা তৈরি ও পরিবারের সঙ্গে যোগাযোগ করুন; হত্যা ও হামলায় সরাসরি জড়িত সন্ত্রাসী ও আইনশৃঙ্খলা রক্ষাকারী বাহিনীর সদস্যদের চিহ্নিত করে রাখুন; যাঁরা যে স্থানে আন্দোলন করেছেন, নতুন করে সংগঠিত হন; নিরাপদে থাকুন, চিকিৎসা নিন ও গ্রেপ্তার এড়ান; ফেসবুকে ক্ষোভ না ঝেড়ে মাঠের প্রস্তুতি নিন; ইন্টারনেটনির্ভর না হয়ে বিকল্প কিছু পরিকল্পনা করুন; আমরা কেন্দ্রীয়ভাবে দ্রুত সবার সঙ্গে যোগাযোগ করব; শিক্ষার্থীরা নিজ নিজ ক্যাম্পাস ও হল খোলার জন্য বিশ্ববিদ্যালয় প্রশাসনকে চাপ দিন; শিক্ষকদের সঙ্গে যোগাযোগ করুন এবং প্রবাসীরা আন্তর্জাতিকভাবে বাংলাদেশের ক্র্যাকডাউন ও হত্যা-নিপীড়নের ঘটনা প্রচার করুন এবং দেশে আন্দোলনরত ছাত্র-নাগরিকদের জন্য সহযোগিতার হাত বাড়ান।\n" +
                "\n" +
                "‘ছাত্র-নাগরিক হত্যা ও গুম-খুনের বিচার, রাষ্ট্রীয় ক্ষয়ক্ষতির বিচার, মামলা প্রত্যাহার ও ডাকসুর সাবেক সমাজসেবা সম্পাদক আখতার হোসেনসহ নিরপরাধ ব্যক্তিদের মুক্তি, আহত-নিহতদের ক্ষতিপূরণ এবং সব ক্যাম্পাসে সন্ত্রাসী রাজনীতির উৎখাত ও বিশ্ববিদ্যালয় প্রশাসনের বিচারের দাবিতে’ দফাভিত্তিক আন্দোলন অব্যাহত রাখার কথা জানানো হয়েছে বিবৃতিতে।", R.drawable.news_img_5, "শাপলা চত্বর,ঢাকা"));

        list.add(new NewsItems("বৈষম্যবিরোধী ছাত্র আন্দোলনের তিন দাবি","২ ঘন্টা আগে", "সোমবার বিকালে ঢাকা বিশ্ববিদ্যালয়ের সন্ত্রাসবিরোধী রাজু ভাস্কর্যের পাদদেশে বৈষম্যবিরোধী ছাত্র আন্দোলনের উদ্যোগে " +
                "‘খুনি শেখ হাসিনার বিচার দাবি ও ক্যাম্পাসে দখলদারিত্বের রাজনীতি বন্ধের’ দাবিতে সমাবেশ হয়। এ সময় খুনিদের পুনর্বাসন করার ষড়যন্ত্র হচ্ছে জানিয়ে সমন্বয়ক হাসনাত" +
                " আব্দুল্লাহ উপদেষ্টাদের বক্তব্যের সমালোচনা করেন এবং তিন দফা দাবি তুলে ধরেন। কোটা সংস্কার আন্দোলনকারীদের প্লাটফর্ম বৈষম্যবিরোধী ছাত্র আন্দোলনের কমিটি ৬৫ সদস্য থেকে বাড়িয়ে ১৫৮ সদস্য করা হয়েছে।\n" +
                "\n" +
                "শনিবার বৈষম্যবিরোধী ছাত্র আন্দোলনের প্যাডে এক বিজ্ঞপ্তিতে এ ঘোষণা দেন আন্দোলনের অন্যতম সমন্বয়ক রিফাত রশিদ।\n" +
                "\n" +
                "বিজ্ঞপ্তিতে বলা হয়, “বৈষম্যবিরোধী ছাত্র আন্দোলনে নির্মমভাবে চালানো গণহত্যার বিচার, গণহত্যায় দায়ীদের পদত্যাগ এবং গ্রেপ্তারদের মুক্তির দাবিতে সারা দেশে আন্দোলনরত শিক্ষার্থী প্রতিনিধিদের নিয়ে ১৫৮ সদস্য বিশিষ্ট সমন্বয়ক টিম গঠন করা হল।”\n" +
                "\n" +
                "আন্দোলনের সুবিধার্থে সামনের দিনে দেশের বিভিন্ন প্রতিষ্ঠানের সমন্বয়কদের নিয়ে সমন্বয়ক টিম বর্ধিত করা হবে বলেও বিজ্ঞপ্তিতে জানানো হয়।\n" +
                "\n" +
                "বর্ধিত কমিটিতে সমন্বয়ক হিসেবে ৪৯ জন এবং সহ-সমন্বয়ক হিসেবে ১০৯ জন শিক্ষার্থীকে রাখা হয়েছে।\n" +
                "\n" +
                "চাকরিতে কোটা বাতিল করে ২০১৮ সালে জারি করা পরিপত্রটি হাই কোর্ট বাতিল করার প্রতিক্রিয়ায় আন্দোলনে নামে শিক্ষার্থীরা। কোটা আন্দোলনের কর্মসূচি বাস্তবায়নে গত ৮ জুলাই ৬৫ সদস্য বিশিষ্ট সমন্বয়ক টিম গঠন করে বৈষম্যবিরোধী ছাত্র আন্দোলন।\n" +
                "\n" +
                "ওই কমিটিতে সমন্বয়ক হিসেবে ২৩ জন এবং ৪২ জনকে সহ-সমন্বয়ক হিসেবে রাখা হয়েছিল। এবার কমিটি বর্ধিত করে এখন ১৫৮ সদস্যের করা হল।", R.drawable.news_img_1, "জামাল খান, চট্টগ্রাম"));
        list.add(new NewsItems("আজ যে কর্মসূচি পালন করবে বৈষম্যবিরোধী ছাত্র আন্দোলন","৪ ঘন্টা আগে", "শেখ হাসিনার বিচারসহ চার দফা দাবিতে সপ্তাহব্যাপী কর্মসূচির ডাক দিয়েছে বৈষম্যবিরোধী ছাত্র আন্দোলন। ‘রেজিস্টান্স উইক’-এর অংশ হিসেবে আজ বুধবার (১৪ আগস্ট) বিকেল সাড়ে ৪টায় শাহবাগে অবস্থান কর্মসূচি এবং শহীদদের স্মরণে শাহবাগ থেকে রাফা প্লাজা অভিমুখে পদযাত্রা, মোমবাতি প্রজ্জ্বলন ও প্রার্থনা কর্মসূচির আয়োজন করা হয়েছে।\n" +
                "\n" +
                "বৈষম্যবিরোধী ছাত্র আন্দোলনের সমন্বয়ক হাসনাত আব্দুল্লাহ নিজের ফেসবুক লাইভে বলেন, শিক্ষার্থী মুগ্ধ-ফাইয়াজসহ যেসব সহযোদ্ধারা রাজপথে রক্ত ঝড়িয়ে নিজের জীবন দিয়ে শহীদ হয়েছেন, তাদের স্মরণে আজ বিকেল সাড়ে ৪টায় জমায়েত হওয়ার আহ্বান জানানো হচ্ছে শিক্ষার্থীদের।\n" +
                "\n" +
                "তিনি আরও বলেন, সেখান থেকে মিছিল শুরু হবে। মিছিল প্রদক্ষিণ করে ধানমন্ডি ৩২-এর রাফা প্লাজা ভবনের সামনে গিয়ে মুগ্ধ-ফাইয়াজসহ অন্যান্য শহীদকে স্মরণ করা হবে। সেখানে আমরা মোমবাতি প্রজ্বলন করব এবং ধর্মীয় বিধান অনুযায়ী প্রার্থনা করব।\n" +
                "\n" +
                "সমন্বয়ক হাসনাত আব্দুল্লাহ বলেন, ধানমন্ডির ওই এলাকার স্কুল-কলেজের সকল শিক্ষার্থী রাফা প্লাজা অভিমুখে যাত্রা করবেন এবং তাদের এই কর্মসূচিতে অংশগ্রহণ করার আহ্বান জানানো হচ্ছে।\n" +
                "\n" +
                "বৈষম্যবিরোধী ছাত্র আন্দোলনের চার দফা দাবিগুলো হলো–\n" +
                "\n" +
                "১ ) ফ্যাসিবাদী কাঠামোকে ব্যবহার করে ফ্যাসিস্ট হাসিনা এবং তার দল ও সরকার যে হত্যাযজ্ঞ চালিয়েছে, সেগুলোর দ্রুত বিচার নিশ্চিত করতে বিশেষ ট্রাইব্যুনাল গঠন করতে হবে।\n" +
                "\n" +
                "২ ) সংখ্যালঘুদের ওপর আওয়ামী লীগ ও এর সহযোগী মহাজোটের শরিক দলগুলোর পরিকল্পিত হত্যা, ডাকাতি ও লুণ্ঠনের মাধ্যমে গণ-অভ্যুত্থানকে বিতর্কিত করার প্রচেষ্টায় অংশগ্রহণকারীদের দ্রুত বিচারের আওতায় আনতে হবে এবং সংখ্যালঘুদের ন্যায্য দাবি মেনে নিতে হবে।\n" +
                "\n" +
                "৩ ) প্রশাসন ও বিচার বিভাগে যারা ছাত্র-জনতার অভ্যুত্থানে হামলা, মামলা এবং হত্যাযজ্ঞকে বৈধতা দিয়েছে এবং ফ্যাসিবাদী ব্যবস্থা বারবার কায়েমের চেষ্টা করছে, তাদের দ্রুততম সময়ে অপসারণ ও নতুন সরকারে তাদের নিয়োগ বাতিল করে বিচারের আওতায় আনতে হবে।\n" +
                "\n" +
                "৪ ) প্রশাসন ও বিচার বিভাগে যারা এতদিন বৈষম্যের শিকার হয়েছে, তাদের জন্য দ্রুততম সময়ে সুযোগের সমতা নিশ্চিত করতে হবে।", R.drawable.news_img_2, "তিতুমির হল,রাজশাহী"));
        list.add(new NewsItems("এবার ‘কমপ্লিট শাটডাউন’ ঘোষণা বৈষম্যবিরোধী ছাত্র আন্দোলনের","১ ঘন্টা আগে", "সারা দেশে বৃহস্পতিবার থেকে 'কমপ্লিট শাটডাউন' কর্মসূচি ঘোষণা করেছে বৈষম্যবিরোধী ছাত্র আন্দোলন।\n" +
                "\n" +
                "বুধবার সন্ধ্যায় এ ঘোষণা দেন বৈষম্যবিরোধী ছাত্র আন্দোলনের অন্যতম সমন্বয়ক আসিফ মাহমুদ।\n" +
                "\n" +
                "কর্মসূচির বিস্তারিত জানিয়ে রাত পৌনে ৮টায় ফেসবুকে একটি পোস্ট দিয়েছেন আসিফ মাহমুদ।\n" +
                "\n" +
                "‘যা বাবা, ভালো থাকিস চিন্তা করিস না’, সাঈদকে চিরবিদায় কালে মা\n" +
                "\n" +
                "তিনি লেখেন, 'শিক্ষার্থীদের শান্তিপূর্ণ আন্দোলনে ওপর পুলিশ, বিজিবি, র\u200D্যাব, সোয়াটের ন্যাক্কারজনক হামলা, খুনের প্রতিবাদ, খুনিদের বিচার, সন্ত্রাসমুক্ত ক্যাম্পাস নিশ্চিত ও এক দফা দাবিতে আগামীকাল ১৮ই জুলাই সারা দেশে ‘কমপ্লিট শাটডাউন’ ঘোষণা করছি।'\n" +
                "\n" +
                "'শুধুমাত্র হাসপাতাল ও জরুরি সেবা ব্যতীত কোনো প্রতিষ্ঠানের দরজা খুলবে না, অ্যাম্বুলেন্স ব্যতীত সড়কে কোনো গাড়ি চলবে না। সারা দেশের প্রতিটি স্কুল, কলেজ, বিশ্ববিদ্যালয়, প্রাইভেট বিশ্ববিদ্যালয়, মাদরাসা শিক্ষার্থীদের আহ্বান জানাচ্ছি আগামীকালকের কর্মসূচি সফল করুন।\n" +
                "\n" +
                "তিনি আরও লেখেন, 'আমাদের অভিভাবকদের বলছি, আমরা আপনাদেরই সন্তান। আমাদের পাশে দাঁড়ান, রক্ষা করুন। এই লড়াইটা শুধু ছাত্রদের না, দলমত নির্বিশেষে এদেশের আপামর জনসাধারণের'।", R.drawable.news_img_7, "২ নং গেইট, চট্টগ্রাম"));


        list.add(new NewsItems("বৈষম্যবিরোধী ছাত্র আন্দোলনের নতুন কর্মসূচি ঘোষণা","৬ ঘন্টা আগে", "নতুন কর্মসূচি ঘোষণা করেছে কোটা সংস্কার আন্দোলনের প্ল্যাটফর্ম বৈষম্যবিরোধী ছাত্র আন্দোলন। ঘোষিত কর্মসূচি অনুযায়ী শুক্রবার (২ আগস্ট) সারাদেশের মসজিদে মসজিদে জুমার নামাজের পরে দোয়া-কবর জিয়ারত, মন্দির, গির্জাসহ সব প্রার্থনালয়ে প্রার্থনা এবং জুমার নামাজের শেষে ছাত্র-জনতার গণমিছিলের ঘোষণা দেওয়া হয়েছে।\n\n" +
                "বৃহস্পতিবার (১ জুলাই) বিকেল ৫টা ৪০ মিনিটে বৈষম্যবিরোধী ছাত্র আন্দোলন পরিচালিত “কোটা পুনর্বহাল চলবে না” টেলিগ্রাম গ্রুপে অন্যতম সমন্বয়ক আব্দুল কাদের এই ঘোষণা দেন। \n" +
                "\n" +
                "বিবৃতিতে, শ্রমিক, পেশাজীবী, সংস্কৃতিকর্মী, গণমাধ্যমকর্মী, মানবাধিকারকর্মী, বুদ্ধিজীবী, আলেম-ওলামাসহ বাংলাদেশের সব স্তরের নাগরিকদের আগামীকালের ‘প্রার্থনা ও ছাত্র জনতার গণমিছিল’ কর্মসূচিকে স্বতঃস্ফূর্তভাবে সফল করার আহ্বান জানানো হয়।\n \n " +
                "শিক্ষকদের ওপর হামলার নিন্দা জানিয়ে বলা হয়, আজ ছাত্রসমাজ ঘরে শান্তিতে ঘুমাতে পারছে না। প্রতিমুহূর্তে কাটাতে হচ্ছে গ্রেপ্তার ও গুম হওয়ার আতঙ্কে। শহীদ ও গুম হয়ে যাওয়া মানুষের স্বজনের আহাজারিতে ভারী হয়ে উঠছে বাংলার আকাশ বাতাস। এছাড়াও আগামীর বাংলাদেশ গড়ার কারিগর জাতির শ্রেষ্ঠ সন্তান বিশ্ববিদ্যালয়ের সম্মানিত শিক্ষকমন্ডলীর ওপর ক্যাম্পাসের ভেতরে হামলা করেছে পুলিশ। ঢাকা বিশ্ববিদ্যালয়ের লোকপ্রশাসন বিভাগের শ্রদ্ধেয় শিক্ষিকা শেহরীন আমিন মোনামী ও নুসরাত জাহান চৌধুরীর গায়েও হাত তুলেছে পুলিশের কিছু কর্মকর্তা। এই ঘৃণ্য হামলার আমরা তীব্র নিন্দা ও প্রতিবাদ জানাচ্ছি।\n" +
                "\n" +
                "শিক্ষার্থী ও সাধারণ মানুষের ওপর অমানবিক নির্যাতনের কথা উল্লেখ করে বলা হয়, বরিশাল বিশ্ববিদ্যালয়ের ৬ জন সমন্বয়কসহ অসংখ্য ছাত্র-জনতাকে গতকাল গ্রেপ্তার করা হয়েছে। আজ কেন্দ্রীয় ৬ সমন্বয়ককে ডিবি কার্যালয় থেকে ছেড়ে দিলেও এখনো ডাকসুর সাবেক সমাজ সেবা সম্পাদক আক্তার হোসেন, সমন্বয়ক আরিফ সোহেলসহ অসংখ্য ছাত্র জনতাকে কারাগার ও রিমান্ডে নির্যাতন করছে। জুলুম নির্যাতনে নিষ্পেষিত ছাত্র জনতা মুক্তির প্রহর গুনছে। অসংখ্য ছাত্র জনতা হাসপাতালের বেডে কাতরাচ্ছে চিরতরে পঙ্গু হয়ে যাওয়ার শঙ্কা নিয়ে। অনেক ছাত্র ও সাধারণ মানুষ চোখ, কান, হাত, পা কিংবা শরীরের অন্য কোনো অঙ্গ হারিয়ে চিরতরে পঙ্গু হয়ে গেছে।\n" +
                "\n" +
                "এই আন্দোলন কোনো ব্যক্তিগত স্বার্থে নয় উল্লেখ করে বলা হয়, আমাদের আন্দোলন আপনার ও আপনার সন্তানের মুক্তির জন্য। কী অপরাধ ছিল আমাদের? সাংবিধানিক অধিকার চাওয়াটা কি আমাদের অপরাধ? কী অপরাধে শত শত ভাইদের হত্যা করা হলো? আমরা এর জবাব জানি না। কিন্তু এর জবাব ও বিচার না নিয়ে আমরা আমাদের আন্দোলনকে থামাবো না। জাতির এই দুর্দিনে আন্দোলনে অংশ নেওয়ার অপরাধে শহীদ, আহত, পঙ্গু ও গ্রেপ্তার হওয়া সবার স্মরণে আগামীকাল দেশব্যাপী ‘প্রার্থনা-কবর জিয়ারত ও ছাত্র জনতার গণমিছিল’ কর্মসূচি ঘোষণা করছি।", R.drawable.news_img_8,"সদর ঘাট, ফেনী"));
        list.add(new NewsItems("বৈষম্যবিরোধী ছাত্র আন্দোলন শিক্ষার্থীদের ৮ বার্তা দিয়েছে","১১ ঘন্টা আগে", "কোটা সংস্কার আন্দোলনকারীদের প্ল্যাটফর্ম বৈষম্যবিরোধী ছাত্র আন্দোলন – হতাহতদের তালিকা তৈরি, হত্যা ও হামলায় জড়িতদের চিহ্নিত করা, বিশ্ববিদ্যালয় ও হল খুলে দেওয়ার চাপ তৈরি করাসহ আটটি বার্তা দিয়েছে। আন্দোলনকারী শিক্ষার্থীদের উদ্দেশে এসব বার্তা দেন তারা।\n" +
                "\n" +
                "বৃহস্পতিবার (২৫ জুলাই) দুপুরে এসব বার্তাসংবলিত একটি বিবৃতি সামাজিক যোগাযোগমাধ্যম ফেসবুকে পোস্ট করেছেন বৈষম্যবিরোধী ছাত্র আন্দোলনের সমন্বয়ক আসিফ মাহমুদ, আবু বাকের মজুমদার ও রিফাত রশীদ। ‘বর্তমান পরিস্থিতিতে বৈষম্যবিরোধী ছাত্র আন্দোলনের অন্যতম সমন্বয়ক মো. নাহিদ ইসলামের বক্তব্য’ শিরোনামে বিবৃতিটি পোস্ট করা হয়।\n" +
                "\n" +
                "বিবৃতিতে দেওয়া বার্তাগুলো হলো- রংপুরের আবু সাঈদসহ নিহতদের স্মরণ করুন; তাঁদের কবর জিয়ারত করুন; পরিবারের প্রতি সমবেদনা জানান; হাসপাতালে থাকা আহতদের যথাসম্ভব সহযোগিতার চেষ্টা করুন; সক্ষমতা থাকলে নিহতদের পরিবারের কাছে লাশ হস্তান্তর করতে সহায়তা করুন; মর্যাদার সঙ্গে দাফন ও জানাজায় অংশ নিন; হতাহতদের তালিকা তৈরি ও পরিবারের সঙ্গে যোগাযোগ করুন; হত্যা ও হামলায় সরাসরি জড়িত সন্ত্রাসী ও আইনশৃঙ্খলা রক্ষাকারী বাহিনীর সদস্যদের চিহ্নিত করে রাখুন; যাঁরা যে স্থানে আন্দোলন করেছেন, নতুন করে সংগঠিত হন; নিরাপদে থাকুন, চিকিৎসা নিন ও গ্রেপ্তার এড়ান; ফেসবুকে ক্ষোভ না ঝেড়ে মাঠের প্রস্তুতি নিন; ইন্টারনেটনির্ভর না হয়ে বিকল্প কিছু পরিকল্পনা করুন; আমরা কেন্দ্রীয়ভাবে দ্রুত সবার সঙ্গে যোগাযোগ করব; শিক্ষার্থীরা নিজ নিজ ক্যাম্পাস ও হল খোলার জন্য বিশ্ববিদ্যালয় প্রশাসনকে চাপ দিন; শিক্ষকদের সঙ্গে যোগাযোগ করুন এবং প্রবাসীরা আন্তর্জাতিকভাবে বাংলাদেশের ক্র্যাকডাউন ও হত্যা-নিপীড়নের ঘটনা প্রচার করুন এবং দেশে আন্দোলনরত ছাত্র-নাগরিকদের জন্য সহযোগিতার হাত বাড়ান।\n" +
                "\n" +
                "‘ছাত্র-নাগরিক হত্যা ও গুম-খুনের বিচার, রাষ্ট্রীয় ক্ষয়ক্ষতির বিচার, মামলা প্রত্যাহার ও ডাকসুর সাবেক সমাজসেবা সম্পাদক আখতার হোসেনসহ নিরপরাধ ব্যক্তিদের মুক্তি, আহত-নিহতদের ক্ষতিপূরণ এবং সব ক্যাম্পাসে সন্ত্রাসী রাজনীতির উৎখাত ও বিশ্ববিদ্যালয় প্রশাসনের বিচারের দাবিতে’ দফাভিত্তিক আন্দোলন অব্যাহত রাখার কথা জানানো হয়েছে বিবৃতিতে।", R.drawable.news_img_9, "শাপলা চত্বর,ঢাকা"));

        filteredList.addAll(list);

    }

    private void filter(String text) {
        // Clear the previous filtered list
        filteredList.clear();

        if (text.isEmpty()) {
            // If search query is empty, add all items
            filteredList.addAll(list);
        } else {
            // Filter the list based on search query
            for (NewsItems item : list) {
                // Check if item name contains the search text (case-insensitive)
                if (item.getTitle().toLowerCase().contains(text.toLowerCase())) {
                    filteredList.add(item);
                }
            }
        }

        // Notify the adapter of the data change
        adapter.notifyDataSetChanged();
    }
}